gkgkfndudals/stm32F405_Project/Ver 0.3/UART_Ver0.2/Pulse_test/src/main.c
/*
 * This file is part of the 쨉OS++ distribution.
 *   (https://github.com/micro-os-plus)
 * Copyright (c) 2014 Liviu Ionescu.
 *
 * Permission is hereby granted, free of charge, to any person
 * obtaining a copy of this software and associated documentation
 * files (the "Software"), to deal in the Software without
 * restriction, including without limitation the rights to use,
 * copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom
 * the Software is furnished to do so, subject to the following
 * conditions:
 *
 * The above copyright notice and this permission notice shall be
 * included in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
 * NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT
 * HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
 * WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 */

// ----------------------------------------------------------------------------
#include <stdio.h>
#include <stdlib.h>
#include "diag/Trace.h"

#include "Timer.h"
#include "BlinkLed.h"

// ----------------------------------------------------------------------------
//
// Standalone STM32F4 led blink sample (trace via ITM).
//
// In debug configurations, demonstrate how to print a greeting message
// on the trace device. In release configurations the message is
// simply discarded.
//
// Then demonstrates how to blink a led with 1 Hz, using a
// continuous loop and SysTick delays.
//
// Trace support is enabled by adding the TRACE macro definition.
// By default the trace messages are forwarded to the ITM output,
// but can be rerouted to any device or completely suppressed, by
// changing the definitions required in system/src/diag/trace_impl.c
// (currently OS_USE_TRACE_ITM, OS_USE_TRACE_SEMIHOSTING_DEBUG/_STDOUT).
//

// ----- Timing definitions -------------------------------------------------

// Keep the LED on for 2/3 of a second.
#define BLINK_ON_TICKS  (TIMER_FREQUENCY_HZ * 3 / 4)
#define BLINK_OFF_TICKS (TIMER_FREQUENCY_HZ - BLINK_ON_TICKS)

// ----- main() ---------------------------------------------------------------

// Sample pragmas to cope with warnings. Please note the related line at
// the end of this function, used to pop the compiler diagnostics status.
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"
#pragma GCC diagnostic ignored "-Wmissing-declarations"
#pragma GCC diagnostic ignored "-Wreturn-type"

#include "stm32f4xx_hal.h"
#include "stm32f4xx.h"

#define TRIG GPIO_PIN_0
#define ECHO GPIO_PIN_1
GPIO_InitTypeDef gp;
UART_HandleTypeDef UartHandle;

GPIO_InitTypeDef GPIO_Init_Struct;
TIM_HandleTypeDef TimHandle2;
uint32_t pulse_count = 0;
uint8_t toggle = 0;

#define countof(a)	(sizeof(a)/sizeof(*(a)))
#define TxBufferSize (countof(TxBuffer)-1)
#define RxBufferSize	(0xFF)

uint8_t TxBuffer[] = "Booting_UART1\n\r";
uint8_t RxBuffer[RxBufferSize];
void my_ms_delay_int_count(volatile unsigned int n) {
	for (n *= 14000; n > 0; n--)
		;
}

void my_us_delay_int_count(volatile unsigned int n) {
	for (n *= 14; n > 0; n--)
		;
}

void UART_config(void) {  // PA9(UART1_Tx), PA10(UART1_Rx)
	__HAL_RCC_GPIOA_CLK_ENABLE()
	;
	__HAL_RCC_USART1_CLK_ENABLE()
	;

	gp.Pin = GPIO_PIN_9 | GPIO_PIN_10;
	gp.Mode = GPIO_MODE_AF_PP;
	gp.Pull = GPIO_NOPULL;
	gp.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	gp.Alternate = GPIO_AF7_USART1;
	HAL_GPIO_Init(GPIOA, &gp);

	UartHandle.Instance = USART1;
	UartHandle.Init.BaudRate = 9600;
	UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
	UartHandle.Init.StopBits = UART_STOPBITS_1;
	UartHandle.Init.Parity = UART_PARITY_NONE;
	UartHandle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	UartHandle.Init.Mode = UART_MODE_TX_RX;
	UartHandle.Init.OverSampling = UART_OVERSAMPLING_16;
	HAL_UART_Init(&UartHandle);

	HAL_NVIC_SetPriority(USART1_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(USART1_IRQn);
}

int Ultra_Sonic_Config() {
	// Enable GPIOC clock
	__HAL_RCC_GPIOC_CLK_ENABLE()
	;

	// Configure PC0 I0 in output
	GPIO_Init_Struct.Pin = TRIG;
	GPIO_Init_Struct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_Init_Struct.Pull = GPIO_NOPULL;
	GPIO_Init_Struct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(GPIOC, &GPIO_Init_Struct);

	// Configure PC1 pin as input
	GPIO_Init_Struct.Pin = ECHO;
	GPIO_Init_Struct.Mode = GPIO_MODE_IT_RISING;
	HAL_GPIO_Init(GPIOC, &GPIO_Init_Struct);
	// Enable and set EXTI Line0 Interrupt to the lowest priority
	HAL_NVIC_SetPriority(EXTI1_IRQn, 2, 0);
	HAL_NVIC_EnableIRQ(EXTI1_IRQn);
	HAL_GPIO_WritePin(GPIOC, TRIG, GPIO_PIN_RESET);

	return 0;
}

void pulse() {   // 10usec High 펄스 출력
	HAL_GPIO_WritePin(GPIOC, TRIG, GPIO_PIN_SET);   // input pulse -> PC0
	my_us_delay_int_count(10);
	HAL_GPIO_WritePin(GPIOC, TRIG, GPIO_PIN_RESET);   // input pulse -> PC0
}

void timer2_config(void) {
	__HAL_RCC_TIM2_CLK_ENABLE()
	;
	TimHandle2.Instance = TIM2;
	//42MHz 4200 0000Hz
	TimHandle2.Init.Period = 10000 - 1; // 0~9999개(ARR) -> 10000개
	TimHandle2.Init.Prescaler = 8400 - 1;
	TimHandle2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	TimHandle2.Init.CounterMode = TIM_COUNTERMODE_DOWN;
	HAL_TIM_Base_Init(&TimHandle2);

	HAL_TIM_Base_Start_IT(&TimHandle2);

	HAL_NVIC_SetPriority(TIM2_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(TIM2_IRQn);
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	pulse_count++;
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
	if (toggle == 0) {   // 카운터를 시작하고 외부인터럽트(INT0)를 다음에는 falling Edge에서 걸리도록 설정
		pulse_count = 0;   // 측정된 이전 거리값 초기화

		//Start Timer
		HAL_TIM_Base_Start_IT(&TimHandle2);

		//외부인터럽트 INT0 falling edge에서 인터럽트 발생
		GPIO_Init_Struct.Pin = ECHO;
		GPIO_Init_Struct.Mode = GPIO_MODE_IT_FALLING;
		HAL_GPIO_Init(GPIOC, &GPIO_Init_Struct);

		toggle = 1;
	} else {
		//Stop Timer
		HAL_TIM_Base_Stop_IT(&TimHandle2);
		//외부인터럽트 INT0 falling edge에서 인터럽트 발생
		GPIO_Init_Struct.Pin = ECHO;
		GPIO_Init_Struct.Mode = GPIO_MODE_IT_RISING;
		HAL_GPIO_Init(GPIOC, &GPIO_Init_Struct);

		toggle = 0;

		sprintf(TxBuffer, "time : %d us, distance(cm) : %d\r\n",(int) pulse_count * 58, (int) pulse_count);
		HAL_UART_Transmit(&UartHandle, (uint8_t*) TxBuffer, strlen(TxBuffer), 0xFFFF);

	}
}

int main(int argc, char* argv[]) {
	// Send a greeting to the trace device (skipped on Release).
	UART_config();

	Ultra_Sonic_Config();

	timer2_config();

	HAL_UART_Transmit(&UartHandle, (uint8_t*) TxBuffer, TxBufferSize, 0xFFFF);
	// Infinite loop
	while (1) {
		pulse();
		my_ms_delay_int_count(1000);
	}
	// Infinite loop, never return.
}

#pragma GCC diagnostic pop

// ----------------------------------------------------------------------------
